# Brewfile — managed by dotfiles (stow homebrew → ~/Brewfile)
# Install everything: brew bundle
# Check what's missing: brew bundle check
# Remove unlisted packages: brew bundle cleanup --force

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------

# tap "databricks/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"

# ---------------------------------------------------------------------------
# Shell
# ---------------------------------------------------------------------------

brew "stow"                          # dotfiles symlink manager
brew "starship"                      # cross-shell prompt
brew "tmux"                          # terminal multiplexer
brew "zsh-autosuggestions"           # fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting"       # fish-like syntax highlighting for zsh
brew "zsh-history-substring-search"  # history search with up/down arrows

# ---------------------------------------------------------------------------
# CLI Tools
# ---------------------------------------------------------------------------

brew "bat"              # cat with syntax highlighting
brew "eza"              # modern ls replacement
brew "fzf"              # fuzzy finder
brew "ripgrep"          # fast grep (rg)
brew "tree"             # directory tree viewer
brew "tlrc"             # tldr pages client (community-maintained)
brew "thefuck"          # corrects previous console command
brew "zoxide"           # smarter cd
brew "git-delta"        # better git diffs
brew "git-filter-repo"  # fast git history rewriting
brew "lazygit"          # terminal UI for git
brew "act"              # run GitHub Actions locally
brew "gh"               # GitHub CLI

# ---------------------------------------------------------------------------
# Editors & Dev Tools
# ---------------------------------------------------------------------------

brew "neovim"    # hyperextensible Vim-based editor
brew "lazygit"   # terminal UI for git
brew "mise"        # manage multiple versions of Node.js and other languages
brew "pnpm"        # fast, disk-efficient Node package manager
brew "openjdk"     # OpenJDK (Java)
brew "uv"          # fast Python package/project manager
brew "podman"      # daemonless container engine
brew "opencode"  # AI coding agent


# ---------------------------------------------------------------------------
# Infrastructure / Cloud
# ---------------------------------------------------------------------------

# brew "hashicorp/tap/terraform"  # infrastructure as code
# brew "terraform-docs"           # auto-generate Terraform docs
# brew "tflint"                   # Terraform linter
# brew "databricks/tap/databricks" # Databricks CLI

# ---------------------------------------------------------------------------
# Window Management / UI
# ---------------------------------------------------------------------------

brew "felixkratz/formulae/borders" # window border highlights (JankyBorders)

# ---------------------------------------------------------------------------
# Casks — Applications
# ---------------------------------------------------------------------------

# Window Management & Desktop
cask "aerospace"          # tiling window manager
cask "alt-tab"            # windows-style alt-tab for macOS
cask "betterdisplay"      # display management
cask "hiddenbar"          # hide menu bar icons
cask "stats"              # system stats in menu bar
cask "flux-app"           # blue light filter
cask "raycast"            # spotlight replacement / launcher
cask "shottr"             # screenshot tool

# Terminals
cask "wezterm"   # GPU-accelerated terminal (primary)
cask "ghostty"   # fast terminal emulator

# Editors & IDEs
cask "zed"            # Zed editor
cask "cursor"         # AI-first code editor
cask "visual-studio-code" # VS Code

# Notes
cask "obsidian"       # markdown knowledge base

# Browsers
cask "google-chrome" # Chrome browser
cask "zen"           # Zen browser

# Containers & Virtualization
cask "docker-desktop" # Docker Desktop (includes CLI tools)
cask "orbstack"       # fast Docker/Linux VM alternative

# API & Network
cask "postman"  # API client

cask "vlc"   # open-source media player

# Diagramming
cask "drawio" # diagrams.net desktop

# Fonts
cask "font-iosevka-nerd-font"  # Iosevka Nerd Font
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font

# VSCode Extensions

vscode "akamud.vscode-theme-onedark"
vscode "albert.tabout"
vscode "antfu.theme-vitesse"
vscode "beardedbear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "deque-systems.vscode-axe-linter"
vscode "dionannd.tokyo-night-ported-nvim"
vscode "dnlytras.nord-wave"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "htmlhint.vscode-htmlhint"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "keksiqc.idx-monospace-theme"
vscode "kevinrose.vsc-python-indent"
vscode "marnix.peacock"
vscode "marnix.tokyo-night-pro"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sainnhe.everforest"
vscode "sdras.night-owl"
vscode "seansassenrath.vscode-theme-superonedark"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "sveggiani.vscode-field-lights"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thang-nm.flow-icons"
vscode "tomoki1207.pdf"
vscode "tsandall.opa"
vscode "usernamehw.errorlens"
vscode "wakatime.vscode-wakatime"
vscode "whizkydee.material-palenight-theme"
vscode "zhuangtongfa.material-theme"
